Samsung/TizenRT/os/board/bk7239n/src/components/tfm/tfm/platform/ext/target/beken/common/hal/accelerator/dubhe_driver/inc/crypto/dubhe_regs.h
/**
 * @if copyright_display
 *      Copyright (C), 2018-2021, Arm Technology (China) Co., Ltd.
 *      All rights reserved
 *
 *      The content of this file or document is CONFIDENTIAL and PROPRIETARY
 *      to Arm Technology (China) Co., Ltd. It is subject to the terms of a
 *      License Agreement between Licensee and Arm Technology (China) Co., Ltd
 *      restricting among other things, the use, reproduction, distribution
 *      and transfer.  Each of the embodiments, including this information and
 *      any derivative work shall retain this copyright notice.
 * @endif
 */

#ifndef __DBH_REGS_H__
#define __DBH_REGS_H__

#include <stdint.h>
#ifdef REG_DEBUG
#include "pal_log.h"
#endif

/* Top register map */
#define DBH_BASE_TOP_CTRL             0x0000UL
#define DBH_BASE_TOP_STAT             0x0100UL
#define DBH_BASE_SECURE_TRNG_CTRL     0x0200UL
#define DBH_BASE_SECURE_TRNG_POOL     0x0280UL
#define DBH_BASE_DBG_CTRL             0x0300UL
#define DBH_BASE_OTP_MGR              0x0400UL
#define DBH_BASE_OTP_SPACE            0x1000UL
#define DBH_BASE_SECURE_ACA           0x3000UL
#define DBH_BASE_SECURE_SCA           0x3200UL
#define DBH_BASE_SECURE_HASH          0x3280UL
#define DBH_BASE_NORMAL_ACA           0x3400UL
#define DBH_BASE_NORMAL_SCA           0x3600UL
#define DBH_BASE_NORMAL_HASH          0x3680UL
#define DBH_BASE_NORMAL_TRNG_POOL     0x3800UL

#if defined(DUBHE_SECURE)
#define DBH_BASE_ACA DBH_BASE_SECURE_ACA
#define DBH_BASE_SCA DBH_BASE_SECURE_SCA
#define DBH_BASE_HASH DBH_BASE_SECURE_HASH
#define DBH_BASE_TRNG_CTRL DBH_BASE_SECURE_TRNG_CTRL
#define DBH_BASE_TRNG_POOL DBH_BASE_SECURE_TRNG_POOL
#else
#define DBH_BASE_TRNG_CTRL 0 //TODO Fix me
#define DBH_BASE_ACA DBH_BASE_NORMAL_ACA
#define DBH_BASE_SCA DBH_BASE_NORMAL_SCA
#define DBH_BASE_HASH DBH_BASE_NORMAL_HASH
#define DBH_BASE_TRNG_POOL DBH_BASE_NORMAL_TRNG_POOL
#endif

/* Top control: clock_ctrl register */
#define DBH_CLK_CTRL_REG_OFFSET 0x00UL
#define DBH_CLK_CTRL_HASH_EN_BIT_SHIFT      0x00UL
#define DBH_CLK_CTRL_HASH_EN_BIT_SIZE       0x01UL
#define DBH_CLK_CTRL_SCA_EN_BIT_SHIFT       0x01UL
#define DBH_CLK_CTRL_SCA_EN_BIT_SIZE        0x01UL
#define DBH_CLK_CTRL_ACA_EN_BIT_SHIFT       0x02UL
#define DBH_CLK_CTRL_ACA_EN_BIT_SIZE        0x01UL
#define DBH_CLK_CTRL_OTP_EN_BIT_SHIFT       0x03UL
#define DBH_CLK_CTRL_OTP_EN_BIT_SIZE        0x01UL
#define DBH_CLK_CTRL_TRNG_EN_BIT_SHIFT      0x04UL
#define DBH_CLK_CTRL_TRNG_EN_BIT_SIZE       0x01UL
#define DBH_CLK_CTRL_DMA_AHB_EN_BIT_SHIFT   0x05UL
#define DBH_CLK_CTRL_DMA_AHB_EN_BIT_SIZE    0x01UL

/* Top control: reset_ctrl register */
#define DBH_RESET_CTRL_REG_OFFSET   0x04UL
#define DBH_RESET_CTRL_HASH_BIT_SHIFT   0x00UL
#define DBH_RESET_CTRL_HASH_BIT_SIZE    0x01UL
#define DBH_RESET_CTRL_SCA_BIT_SHIFT    0x01UL
#define DBH_RESET_CTRL_SCA_BIT_SIZE     0x01UL
#define DBH_RESET_CTRL_ACA_BIT_SHIFT    0x02UL
#define DBH_RESET_CTRL_ACA_BIT_SIZE     0x01UL
#define DBH_RESET_CTRL_OTP_BIT_SHIFT    0x03UL
#define DBH_RESET_CTRL_OTP_BIT_SIZE     0x01UL
#define DBH_RESET_CTRL_TRNG_BIT_SHIFT   0x04UL
#define DBH_RESET_CTRL_TRNG_BIT_SIZE    0x01UL

/* Top control: top_intr_stat register */
#define DBH_TOP_CTRL_INTR_STAT_REG_OFFSET   0x34UL

/* Top control: top_intr_mask register */
#define DBH_TOP_CTRL_INTR_MASK_REG_OFFSET   0x38UL

/* Top status: dubhe_ver register */
#define DBH_VER_REG_OFFSET  0x00UL
#define DBH_VER_VALUE_BIT_SHIFT     0x00UL
#define DBH_VER_VALUE_BIT_SIZE      0x20UL

/* Top status: dubhe_conf1 */
#define DBH_CFG1_REG_OFFSET 0x04UL
#define DBG_CFG1_OTP_TEST_WORD_SIZE_BIT_SHIFT   0x00UL
#define DBG_CFG1_OTP_TEST_WORD_SIZE_BIT_SIZE    0x0BUL
#define DBG_CFG1_RN_POOL_EXT_HOST_SEC_BIT_SHIFT 0x0FUL
#define DBG_CFG1_RN_POOL_EXT_HOST_SEC_BIT_SIZE  0x01UL
#define DBG_CFG1_RN_POOL_HOST_NUM_BIT_SHIFT     0x10UL
#define DBG_CFG1_RN_POOL_HOST_NUM_BIT_SIZE      0x02UL
#define DBG_CFG1_TRNG_INTER_SRC_EXIST_BIT_SHIFT 0x12UL
#define DBG_CFG1_TRNG_INTER_SRC_EXIST_BIT_SIZE  0x01UL
#define DBG_CFG1_OTP_INIT_VALUE_BIT_SHIFT       0x13UL
#define DBG_CFG1_OTP_INIT_VALUE_BIT_SIZE        0x01UL
#define DBG_CFG1_OTP_EXIST_BIT_SHIFT            0x14UL
#define DBG_CFG1_OTP_EXIST_BIT_SIZE             0x01UL
#define DBG_CFG1_ACA_SRAM_SIZE_BIT_SHIFT        0x15UL
#define DBG_CFG1_ACA_SRAM_SIZE_BIT_SIZE         0x02UL
#define DBG_CFG1_ACA_EXT_HOST_SEC_BIT_SHIFT     0x17UL
#define DBG_CFG1_ACA_EXT_HOST_SEC_BIT_SIZE      0x01UL
#define DBG_CFG1_ACA_HOST_NUM_BIT_SHIFT         0x18UL
#define DBG_CFG1_ACA_HOST_NUM_BIT_SIZE          0x02UL
#define DBG_CFG1_HASH_EXT_HOST_SEC_BIT_SHIFT    0x1AUL
#define DBG_CFG1_HASH_EXT_HOST_SEC_BIT_SIZE     0x01UL
#define DBG_CFG1_HASH_HOST_NUM_BIT_SHIFT        0x1BUL
#define DBG_CFG1_HASH_HOST_NUM_BIT_SIZE         0x02UL
#define DBG_CFG1_SCA_EXT_HOST_SEC_BIT_SHIFT     0x1DUL
#define DBG_CFG1_SCA_EXT_HOST_SEC_BIT_SIZE      0x01UL
#define DBG_CFG1_SCA_HOST_NUM_BIT_SHIFT         0x1EUL
#define DBG_CFG1_SCA_HOST_NUM_BIT_SIZE          0x02UL

/* Top status: dubhe_conf2 */
#define DBH_CFG2_REG_OFFSET 0x08UL
#define DBG_CFG2_OTP_SEC_WORD_SIZE_BIT_SHIFT    0x00UL
#define DBG_CFG2_OTP_SEC_WORD_SIZE_BIT_SIZE     0x0BUL
#define DBG_CFG2_OTP_NSEC_WORD_SIZE_BIT_SHIFT   0x10UL
#define DBG_CFG2_OTP_NSEC_WORD_SIZE_BIT_SIZE    0x0BUL

/* Top status: dubhe_conf3 */
#define DBH_CFG3_REG_OFFSET 0x0CUL
#define DBG_CFG3_INTF_APB3_PAR_IS_ODD_BIT_SHIFT 0x00UL
#define DBG_CFG3_INTF_APB3_PAR_IS_ODD_BIT_SIZE  0x01UL
#define DBG_CFG3_INTF_APB4_PAR_IS_ODD_BIT_SHIFT 0x01UL
#define DBG_CFG3_INTF_APB4_PAR_IS_ODD_BIT_SIZE  0x01UL
#define DBG_CFG3_INTF_AHB_PAR_IS_ODD_BIT_SHIFT  0x02UL
#define DBG_CFG3_INTF_AHB_PAR_IS_ODD_BIT_SIZE   0x01UL
#define DBG_CFG3_INTF_APB3_PAR_ENA_BIT_SHIFT    0x03UL
#define DBG_CFG3_INTF_APB3_PAR_ENA_BIT_SIZE     0x01UL
#define DBG_CFG3_INTF_APB4_PAR_ENA_BIT_SHIFT    0x04UL
#define DBG_CFG3_INTF_APB4_PAR_ENA_BIT_SIZE     0x01UL
#define DBG_CFG3_INTF_AHB_PAR_ENA_BIT_SHIFT     0x05UL
#define DBG_CFG3_INTF_AHB_PAR_ENA_BIT_SIZE      0x01UL

/* Top status: dubhe_intr_stat_host0 register */
#define DBH_TOP_INTR_STAT_HOST0_REG_OFFSET  0x10UL
#define DBH_TOP_INTR_STAT_ACA0_BIT_SHIFT         0x00UL
#define DBH_TOP_INTR_STAT_ACA0_BIT_SIZE          0x01UL
#define DBH_TOP_INTR_STAT_HASH0_BIT_SHIFT        0x01UL
#define DBH_TOP_INTR_STAT_HASH0_BIT_SIZE         0x01UL
#define DBH_TOP_INTR_STAT_SCA0_BIT_SHIFT         0x02UL
#define DBH_TOP_INTR_STAT_SCA0_BIT_SIZE          0x01UL
#define DBH_TOP_INTR_STAT_RNPOOL0_BIT_SHIFT      0x03UL
#define DBH_TOP_INTR_STAT_RNPOOL0_BIT_SIZE       0x01UL
#define DBH_TOP_INTR_STAT_TRNG_BIT_SHIFT         0x04UL
#define DBH_TOP_INTR_STAT_TRNG_BIT_SIZE          0x01UL
#define DBH_TOP_RESERVE_BIT_SHIFT                0x05UL
#define DBH_TOP_RESERVE_BIT_SIZE                 0x03UL

/* Top status: dubhe_intr_stat_host1 register */
#define DBH_TOP_INTR_STAT_HOST1_REG_OFFSET  0x14UL
#define DBH_TOP_INTR_STAT_ACA1_BIT_SHIFT         0x00UL
#define DBH_TOP_INTR_STAT_ACA1_BIT_SIZE          0x01UL
#define DBH_TOP_INTR_STAT_HASH1_BIT_SHIFT        0x01UL
#define DBH_TOP_INTR_STAT_HASH1_BIT_SIZE         0x01UL
#define DBH_TOP_INTR_STAT_SCA1_BIT_SHIFT         0x02UL
#define DBH_TOP_INTR_STAT_SCA1_BIT_SIZE          0x01UL
#define DBH_TOP_INTR_STAT_RNPOOL1_BIT_SHIFT      0x03UL
#define DBH_TOP_INTR_STAT_RNPOOL1_BIT_SIZE       0x01UL

/* Debug control: debug_ctrl register */
#define DBH_DBG_CTRL_REG_OFFSET 0x00UL
#define DBH_DBG_CTRL_VALUE_BIT_SHIFT   0x00UL
#define DBH_DBG_CTRL_VALUE_BIT_SIZE    0x20UL

/* Debug control: debug_ctrl_lock register */
#define DBH_DBG_CTRL_LOCK_REG_OFFSET   0x04UL
#define DBH_DBG_CTRL_LOCK_VALUE_BIT_SHIFT   0x00UL
#define DBH_DBG_CTRL_LOCK_VALUE_BIT_SIZE    0x20UL

/* Debug control: debug_intr_mask register */
#define DBH_DBG_CTRL_INTR_MASK_REG_OFFSET 0x0CUL

/* SCA: sca_quequ register */
#define DBH_SCA_QUEUE_REG_OFFSET    0x00UL
#define DBH_SCA_QUEUE_ENTRY_BIT_SHIFT   0x00UL
#define DBH_SCA_QUEUE_ENTRY_BIT_SIZE    0x20UL

/* SCA: sca_ctrl register */
#define DBH_SCA_CTRL_REG_OFFSET 0x04UL
#define DBH_SCA_RUN_BIT_SHIFT           0x00UL
#define DBH_SCA_RUN_BIT_SIZE            0x01UL
#define DBH_SCA_QUEUE_WM_BIT_SHIFT      0x01UL
#define DBH_SCA_QUEUE_WM_BIT_SIZE       0x07UL
#define DBH_SCA_RESET_BIT_SHIFT         0x08UL
#define DBH_SCA_RESET_BIT_SIZE          0X01UL

