Samsung/TizenRT/os/board/bk7239n/src/components/tfm/tfm/platform/ext/target/beken/common/hal/accelerator/dubhe_driver/inc/crypto/dubhe_regs.h
/* SCA: sca_stat register */
#define DBH_SCA_STAT_REG_OFFSET 0x08UL
#define DBH_SCA_ENGINE_STAT_BIT_SHIFT       0x00UL
#define DBH_SCA_ENGINE_STAT_BIT_SIZE        0x02UL
#define DBH_SCA_QUEUE_AVAIL_SLOTS_BIT_SHIFT 0x02UL
#define DBH_SCA_QUEUE_AVAIL_SLOTS_BIT_SIZE  0x08UL

/* SCA: sca_intr_stat register */
#define DBH_SCA_INTR_STAT_REG_OFFSET    0x0CUL
#define DBH_SCA_CMD_INTR_BIT_SHIFT              0x00UL
#define DBH_SCA_CMD_INTR_BIT_SIZE               0x01UL
#define DBH_SCA_INVALID_CMD_BIT_SHIFT           0x01UL
#define DBH_SCA_INVALID_CMD_BIT_SIZE            0x01UL
#define DBH_SCA_INVALID_KEY_BIT_SHIFT           0x02UL
#define DBH_SCA_INVALID_KEY_BIT_SIZE            0x01UL
#define DBH_SCA_BUS_ERR_BIT_SHIFT               0x03UL
#define DBH_SCA_BUS_ERR_BIT_SIZE                0x01UL
#define DBH_SCA_WM_INTR_BIT_SHIFT               0x04UL
#define DBH_SCA_WM_INTR_BIT_SIZE                0x01UL

/* SCA: sca_intr_mask register */
#define DBH_SCA_INTR_MASK_REG_OFFSET    0x10UL
#define DBH_SCA_INTR_MASK_CMD_INTR_BIT_SHIFT            0x00UL
#define DBH_SCA_INTR_MASK_CMD_INTR_BIT_SIZE             0x01UL
#define DBH_SCA_INTR_MASK_INVALID_CMD_BIT_SHIFT         0x01UL
#define DBH_SCA_INTR_MASK_INVALID_CMD_BIT_SIZE          0x01UL
#define DBH_SCA_INTR_MASK_INVALID_KEY_BIT_SHIFT         0x02UL
#define DBH_SCA_INTR_MASK_INVALID_KEY_BIT_SIZE          0x01UL
#define DBH_SCA_INTR_MASK_BUS_ERR_BIT_SHIFT             0x03UL
#define DBH_SCA_INTR_MASK_BUS_ERR_BIT_SIZE              0x01UL
#define DBH_SCA_INTR_MASK_WM_INTR_BIT_SHIFT             0x04UL
#define DBH_SCA_INTR_MASK_WM_INTR_BIT_SIZE              0x01UL

/* SCA: sca_intr_mask register */
#define DBH_SCA_SUSPEND_MASK_REG_OFFSET                 0x14UL
#define DBH_SCA_SUSPEND_MASK_CMD_INTR_BIT_SHIFT         0x00UL
#define DBH_SCA_SUSPEND_MASK_CMD_INTR_BIT_SIZE          0x01UL
#define DBH_SCA_SUSPEND_MASK_INVALID_CMD_BIT_SHIFT      0x01UL
#define DBH_SCA_SUSPEND_MASK_INVALID_CMD_BIT_SIZE       0x01UL
#define DBH_SCA_SUSPEND_MASK_INVALID_KEY_BIT_SHIFT      0x02UL
#define DBH_SCA_SUSPEND_MASK_INVALID_KEY_BIT_SIZE       0x01UL
#define DBH_SCA_SUSPEND_MASK_BUS_ERR_BIT_SHIFT          0x03UL
#define DBH_SCA_SUSPEND_MASK_BUS_ERR_BIT_SIZE           0x01UL
#define DBH_SCA_SUSPEND_MASK_WM_INTR_BIT_SHIFT          0x04UL
#define DBH_SCA_SUSPEND_MASK_WM_INTR_BIT_SIZE           0x01UL

/* OTP manager: otp_setting register */
#define DBH_OTP_SET_REG_OFFSET  0x00UL
#define DBH_OTP_SET_INIT_DONE_BIT_SHIFT                 0x00UL
#define DBH_OTP_SET_INIT_DONE_BIT_SIZE                  0x01UL
#define DBH_OTP_SET_LCS_LOAD_FAIL_BIT_SHIFT             0x01UL
#define DBH_OTP_SET_LCS_LOAD_FAIL_BIT_SIZE              0x01UL
#define DBH_OTP_SET_MID_LOAD_FAIL_BIT_SHIFT             0x02UL
#define DBH_OTP_SET_MID_LOAD_FAIL_BIT_SIZE              0x01UL
#define DBH_OTP_SET_DEVID_LOAD_FAIL_BIT_SHIFT           0x03UL
#define DBH_OTP_SET_DEVID_LOAD_FAIL_BIT_SIZE            0x01UL
#define DBH_OTP_SET_KEY_LOAD_FAIL_BIT_SHIFT             0x04UL
#define DBH_OTP_SET_KEY_LOAD_FAIL_BIT_SIZE              0x01UL
#define DBH_OTP_SET_LOCK_LOAD_FAIL_BIT_SHIFT            0x05UL
#define DBH_OTP_SET_LOCK_LOAD_FAIL_BIT_SIZE             0x01UL
#define DBH_OTP_SET_DATA_INV_FAIL_BIT_SHIFT             0x06UL
#define DBH_OTP_SET_DATA_INV_FAIL_BIT_SIZE              0x01UL
#define DBH_OTP_SET_LCS_ERR_BIT_SHIFT                   0x07UL
#define DBH_OTP_SET_LCS_ERR_BIT_SIZE                    0x01UL
#define DBH_OTP_SET_DIRECT_RD_BIT_SHIFT                 0x08UL
#define DBH_OTP_SET_DIRECT_RD_BIT_SIZE                  0x01UL
#define DBH_OTP_SET_GENERAL_CTRL_BIT_SHIFT              0x09UL
#define DBH_OTP_SET_GENERAL_CTRL_BIT_SIZE               0x08UL
#define DBH_OTP_SET_GENERAL_CTRL_PTA_BIT_SHIFT          0x09UL
#define DBH_OTP_SET_GENERAL_CTRL_PTA_BIT_SIZE           0x02UL
#define DBH_OTP_SET_GENERAL_CTRL_PAPUF_BIT_SHIFT        0x0BUL
#define DBH_OTP_SET_GENERAL_CTRL_PAPUF_BIT_SIZE         0x01UL
#define DBH_OTP_SET_GENERAL_CTRL_PRESETN_BIT_SHIFT      0x0CUL
#define DBH_OTP_SET_GENERAL_CTRL_PRESETN_BIT_SIZE       0x01UL
#define DBH_OTP_SET_GENERAL_CTRL_PDSTB_BIT_SHIFT        0x0DUL
#define DBH_OTP_SET_GENERAL_CTRL_PDSTB_BIT_SIZE         0x01UL
#define DBH_OTP_SET_GENERAL_CTRL_PENVDD2_BIT_SHIFT      0x0EUL
#define DBH_OTP_SET_GENERAL_CTRL_PENVDD2_BIT_SIZE       0x01UL

/* OTP manager: otp_wr_addr register */
#define DBH_OTP_WR_ADDR_REG_OFFSET  0x04UL
#define DBH_OTP_WR_ADDR_VAL_BIT_SHIFT   0x02UL
#define DBH_OTP_WR_ADDR_VAL_BIT_SIZE    0x0BUL

/* OTP manager: otp_wr_data register */
#define DBH_OTP_WR_DATA_REG_OFFSET  0x08UL
#define DBH_OTP_WR_DATA_VAL_BIT_SHIFT   0x00UL
#define DBH_OTP_WR_DATA_VAL_BIT_SIZE    0x20UL

/* OTP manager: otp_wr register */
#define DBH_OTP_WR_REG_OFFSET   0x0CUL
#define DBH_OTP_WR_TRIG_BIT_SHIFT       0x00UL
#define DBH_OTP_WR_TRIG_BIT_SIZE        0x01UL

/* OTP manager: otp_update_stat register */
#define DBH_OTP_UPDATE_STAT_REG_OFFSET          0x10UL
#define DBH_OTP_UPDATE_STAT_BUSY_BIT_SHIFT      0x00UL
#define DBH_OTP_UPDATE_STAT_BUSY_BIT_SIZE       0x01UL
#define DBH_OTP_UPDATE_STAT_FAIL_BIT_SHIFT      0x01UL
#define DBH_OTP_UPDATE_STAT_FAIL_BIT_SIZE       0x01UL

/* OTP manager: otp_intr_mask register */
#define DBH_OTP_INTR_MASK_REG_OFFSET    0x18UL

/* HASH: hash_queue register */
#define DBH_HASH_QUEUE_REG_OFFSET 0x00UL
#define DBH_HASH_QUEUE_ENTRY_BIT_SHIFT  0x00UL
#define DBH_HASH_QUEUE_ENTRY_BIT_SIZE   0x20UL

/* HASH: hash_ctrl register */
#define DBH_HASH_CTRL_REG_OFFSET    0x04UL
#define DBH_HASH_RUN_BIT_SHIFT          0x00UL
#define DBH_HASH_RUN_BIT_SIZE           0x01UL
#define DBH_HASH_QUEUE_WM_BIT_SHIFT     0x01UL
#define DBH_HASH_QUEUE_WM_BIT_SIZE      0x07UL

/* HASH: hash_stat register */
#define DBH_HASH_STAT_REG_OFFSET    0x08UL
#define DBH_HASH_ENGINE_STAT_BIT_SHIFT              0x00UL
#define DBH_HASH_ENGINE_STAT_BIT_SIZE               0x02UL
#define DBH_HASH_ENGINE_QUEUE_AVAIL_SLOTS_BIT_SHIFT 0x02UL
#define DBH_HASH_ENGINE_QUEUE_AVAIL_SLOTS_BIT_SIZE  0x07UL

/* HASH: hash_intr_stat register */
#define DBH_HASH_INTR_STAT_REG_OFFSET   0x0CUL
#define DBH_HASH_INTR_STAT_CMD_INTR_BIT_SHIFT       0x00UL
#define DBH_HASH_INTR_STAT_CMD_INTR_BIT_SIZE        0x01UL
#define DBH_HASH_INTR_STAT_IVLIAD_CMD_BIT_SHIFT     0x01UL
#define DBH_HASH_INTR_STAT_IVLIAD_CMD_BIT_SHIFT     0x01UL
#define DBH_HASH_INTR_STAT_PADDING_ERR_BIT_SHIFT    0x02UL
#define DBH_HASH_INTR_STAT_PADDING_ERR_BIT_SIZE     0x01UL
#define DBH_HASH_INTR_STAT_BUS_ERR_BIT_SHIFT        0x03UL
#define DBH_HASH_INTR_STAT_BUS_ERR_BIT_SIZE         0x01UL
#define DBH_HASH_INTR_STAT_WM_INTR_BIT_SHIFT        0x04UL
#define DBH_HASH_INTR_STAT_WM_INTR_BIT_SIZE         0x01UL

