Samsung/TizenRT/os/board/bk7239n/src/components/tfm/tfm/platform/ext/target/beken/common/hal/accelerator/dubhe_driver/inc/crypto/dubhe_regs.h
/* HASH: hash_intr_mask register */
#define DBH_HASH_INTR_MASK_REG_OFFSET   0x10UL
#define DBH_HASH_INTR_MASK_CMD_INTR_BIT_SHIFT       0x00UL
#define DBH_HASH_INTR_MASK_CMD_INTR_BIT_SIZE        0x01UL
#define DBH_HASH_INTR_MASK_INVALID_CMD_BIT_SHIFT    0x01UL
#define DBH_HASH_INTR_MASK_INVALID_CMD_BIT_SIZE     0x01UL
#define DBH_HASH_INTR_MASK_PADDING_ERR_BIT_SHIFT    0x02UL
#define DBH_HASH_INTR_MASK_PADDING_ERR_BIT_SIZE     0x01UL
#define DBH_HASH_INTR_MASK_BUS_ERR_BIT_SHIFT        0x03UL
#define DBH_HASH_INTR_MASK_BUS_ERR_BIT_SIZE         0x01UL
#define DBH_HASH_INTR_MASK_WM_INTR_BIT_SHIFT        0x04UL
#define DBH_HASH_INTR_MASK_WM_INTR_BIT_SIZE         0x01UL

/* HASH: hash_suspend_mask register */
#define DBH_HASH_SUSPEND_MASK_REG_OFFSET    0x14UL
#define DBH_HASH_SUSPEND_MASK_CMD_INTR_BIT_SHIFT    0x00UL
#define DBH_HASH_SUSPEND_MASK_CMD_INTR_BIT_SIZE     0x01UL
#define DBH_HASH_SUSPEND_MASK_INVALID_CMD_BIT_SHIFT 0x01UL
#define DBH_HASH_SUSPEND_MASK_INVALID_CMD_BIT_SIZE  0x01UL
#define DBH_HASH_SUSPEND_MASK_PADDING_ERR_BIT_SHIFT 0x02UL
#define DBH_HASH_SUSPEND_MASK_PADDING_ERR_BIT_SIZE  0x01UL
#define DBH_HASH_SUSPEND_MASK_BUS_ERR_BIT_SHIFT     0x03UL
#define DBH_HASH_SUSPEND_MASK_BUS_ERR_BIT_SIZE      0x01UL
#define DBH_HASH_SUSPEND_MASK_WM_INTR_BIT_SHIFT     0x04UL
#define DBH_HASH_SUSPEND_MASK_WM_INTR_BIT_SIZE      0x01UL

/* TRNG CTRL: entropy_src register */
#define DBH_TRNG_ENTROPY_SRC_REG_OFFSET         0x04UL
#define DBH_TRNG_ENTROPY_SRC_CHAIN0_EN_BIT_SHIFT        0x00UL
#define DBH_TRNG_ENTROPY_SRC_CHAIN0_EN_BIT_SIZE         0x01UL
#define DBH_TRNG_ENTROPY_SRC_CHAIN1_EN_BIT_SHIFT        0x01UL
#define DBH_TRNG_ENTROPY_SRC_CHAIN1_EN_BIT_SIZE         0x01UL
#define DBH_TRNG_ENTROPY_SRC_CHAIN2_EN_BIT_SHIFT        0x02UL
#define DBH_TRNG_ENTROPY_SRC_CHAIN2_EN_BIT_SIZE         0x01UL
#define DBH_TRNG_ENTROPY_SRC_CHAIN3_EN_BIT_SHIFT        0x03UL
#define DBH_TRNG_ENTROPY_SRC_CHAIN3_EN_BIT_SIZE         0x01UL
#define DBH_TRNG_ENTROPY_SRC_SELECT_BIT_SHIFT           0x04UL
#define DBH_TRNG_ENTROPY_SRC_SELECT_BIT_SIZE            0x01UL

/* TRNG CTRL: entropy_sample register */
#define DBH_TRNG_ENTROPY_SAMPLE_REG_OFFSET      0x08UL
#define DBH_TRNG_ENTROPY_SAMPLE_RATE_DIV_BIT_SHIFT      0x00UL
#define DBH_TRNG_ENTROPY_SAMPLE_RATE_DIV_BIT_SIZE       0x10UL
#define DBH_TRNG_ENTROPY_SAMPLE_DELAY_BIT_SHIFT         0x10UL
#define DBH_TRNG_ENTROPY_SAMPLE_DELAY_BIT_SIZE          0x08UL

/* TRNG CTRL: ro_setting register */
#define DBH_TRNG_RO_SETTING_REG_OFFSET          0x0CUL
#define DBH_TRNG_RO_SETTING_GROUP0_RO_TAPS_EN_BIT_SHIFT 0x00UL
#define DBH_TRNG_RO_SETTING_GROUP0_RO_TAPS_EN_BIT_SIZE  0X03UL
#define DBH_TRNG_RO_SETTING_GROUP1_RO_TAPS_EN_BIT_SHIFT 0x04UL
#define DBH_TRNG_RO_SETTING_GROUP1_RO_TAPS_EN_BIT_SIZE  0X03UL
#define DBH_TRNG_RO_SETTING_GROUP2_RO_TAPS_EN_BIT_SHIFT 0x08UL
#define DBH_TRNG_RO_SETTING_GROUP2_RO_TAPS_EN_BIT_SIZE  0X03UL
#define DBH_TRNG_RO_SETTING_GROUP3_RO_TAPS_EN_BIT_SHIFT 0x0CUL
#define DBH_TRNG_RO_SETTING_GROUP3_RO_TAPS_EN_BIT_SIZE  0X03UL

/* TRNG CTRL: post_process register */
#define DBH_TRNG_POST_PROCESS_REG_OFFSET        0x10UL
#define DBH_TRNG_POST_PROCESS_PRNG_BYPASS_BIT_SHIFT     0x00UL
#define DBH_TRNG_POST_PROCESS_PRNG_BYPASS_BIT_SIZE      0x01UL
#define DBH_TRNG_POST_PROCESS_VN_BYPASS_BIT_SHIFT       0x01UL
#define DBH_TRNG_POST_PROCESS_VN_BYPASS_BIT_SIZE        0x01UL
#define DBH_TRNG_POST_PROCESS_CRNG_BYPASS_BIT_SHIFT     0x02UL
#define DBH_TRNG_POST_PROCESS_CRNG_BYPASS_BIT_SIZE      0x01UL

/* TRNG CTRL: evaluation_setting register */
#define DBH_TRNG_EVAL_REG_OFFSET                0x14UL
#define DBH_TRNG_EVAL_ADP_TEST_TH_BIT_SHIFT             0x00UL
#define DBH_TRNG_EVAL_ADP_TEST_TH_BIT_SIZE              0x0AUL
#define DBH_TRNG_EVAL_REP_TEST_TH_BIT_SHIFT             0x0AUL
#define DBH_TRNG_EVAL_REP_TEST_TH_BIT_SIZE              0x06UL
#define DBH_TRNG_EVAL_ADP_TEST_EN_BIT_SHIFT             0x10UL
#define DBH_TRNG_EVAL_ADP_TEST_EN_BIT_SIZE              0x01UL
#define DBH_TRNG_EVAL_REP_TEST_EN_BIT_SHIFT             0x11UL
#define DBH_TRNG_EVAL_REP_TEST_EN_BIT_SIZE              0x01UL
#define DBH_TRNG_EVAL_AUTO_CORR_TEST_EN_BIT_SHIFT       0x12UL
#define DBH_TRNG_EVAL_AUTO_CORR_TEST_EN_BIT_SIZE        0x01UL
#define DBH_TRNG_EVAL_AUTO_CORR_TEST_TH_BIT_SHIFT       0x13UL
#define DBH_TRNG_EVAL_AUTO_CORR_TEST_TH_BIT_SIZE        0x04UL

/* TRNG CTRL: trng_intr_stat register */
#define DBH_TRNG_INTR_REG_OFFSET                0x1CUL
#define DBH_TRNG_INTR_VN_ERR_BIT_SHIFT                  0x00UL
#define DBH_TRNG_INTR_VN_ERR_BIT_SIZE                   0x01UL
#define DBH_TRNG_INTR_CRNG_ERR_BIT_SHIFT                0x01UL
#define DBH_TRNG_INTR_CRNG_ERR_BIT_SIZE                 0x01UL
#define DBH_TRNG_INTR_REP_TEST_ERR_BIT_SHIFT            0x02UL
#define DBH_TRNG_INTR_REP_TEST_ERR_BIT_SIZE             0x01UL
#define DBH_TRNG_INTR_ADP_TEST_ERR_BIT_SHIFT            0x03UL
#define DBH_TRNG_INTR_ADP_TEST_ERR_BIT_SIZE             0x01UL

/* TRNG CTRL: trng_intr_mask register */
#define DBH_TRNG_INTR_MASK_REG_OFFSET           0x20UL
#define DBH_TRNG_INTR_MASK_VN_ERR_BIT_SHIFT             0x00UL
#define DBH_TRNG_INTR_MASK_VN_ERR_BIT_SIZE              0x01UL
#define DBH_TRNG_INTR_MASK_CRNG_ERR_BIT_SHIFT           0x01UL
#define DBH_TRNG_INTR_MASK_CRNG_ERR_BIT_SIZE            0x01UL
#define DBH_TRNG_INTR_MASK_REP_TEST_ERR_BIT_SHIFT       0x02UL
#define DBH_TRNG_INTR_MASK_REP_TEST_ERR_BIT_SIZE        0x01UL
#define DBH_TRNG_INTR_MASK_ADP_TEST_ERR_BIT_SHIFT       0x03UL
#define DBH_TRNG_INTR_MASK_ADP_TEST_ERR_BIT_SIZE        0x01UL

/* TRNG CTRL: err_cnt_threshold register */
#define DBH_TRNG_ERR_CNT_TH_REG_OFFSET          0x24UL
#define DBH_TRNG_ERR_CNT_TH_VN_ERR_BIT_SHIFT            0x00UL
#define DBH_TRNG_ERR_CNT_TH_VN_ERR_BIT_SIZE             0x04UL
#define DBH_TRNG_ERR_CNT_TH_CRNG_ERR_BIT_SHIFT          0x08UL
#define DBH_TRNG_ERR_CNT_TH_CRNG_ERR_BIT_SIZE           0x08UL
#define DBH_TRNG_ERR_CNT_TH_REP_ERR_BIT_SHIFT           0x10UL
#define DBH_TRNG_ERR_CNT_TH_REP_ERR_BIT_SIZE            0x08UL
#define DBH_TRNG_ERR_CNT_TH_ADAP_ERR_BIT_SHIFT          0x18UL
#define DBH_TRNG_ERR_CNT_TH_ADAP_ERR_BIT_SIZE           0x08UL

/* TRNG CTRL: xxx_test_total_cnt register */
#define DBH_TRNG_VN_TEST_TOTAL_CNT_REG_OFFSET   0x28UL
#define DBH_TRNG_CRNG_TEST_TOTAL_CNT_REG_OFFSET 0x2CUL
#define DBH_TRNG_REP_TEST_TOTAL_CNT_REG_OFFSET  0x30UL
#define DBH_TRNG_ADAP_TEST_TOTAL_CNT_REG_OFFSET 0x34UL

/* TRNG Pool: rn_pool_ctrl register */
#define DBH_TRNG_POOL_CTRL_REG_OFFSET           0x00UL
#define DBH_TRNG_POOL_CTRL_FILL_REQ_BIT_SHIFT           0x00UL
#define DBH_TRNG_POOL_CTRL_FILL_REQ_BIT_SIZE            0x01UL
#define DBH_TRNG_POOL_CTRL_CLOCK_ENABLE_BIT_SHIFT       0x01UL
#define DBH_TRNG_POOL_CTRL_CLOCK_ENABLE_BIT_SIZE        0x01UL

/* TRNG Pool: rn_pool_stat register */
#define DBH_TRNG_POOL_STAT_REG_OFFSET           0x04UL
#define DBH_TRNG_POOL_STAT_AUTO_CORR_TEST_ERR_BIT_SHIFT 0x00UL
#define DBH_TRNG_POOL_STAT_AUTO_CORR_TEST_ERR_BIT_SIZE  0x01UL
#define DBH_TRNG_POOL_STAT_TRNG_CORE_STAT_BIT_SHIFT     0x01UL
#define DBH_TRNG_POOL_STAT_TRNG_CORE_STAT_BIT_SIZE      0x02UL

/* TRNG Pool: rn_pool_intr register */
#define DBH_TRNG_POOL_INTR_REG_OFFSET           0x08UL
#define DBH_TRNG_POOL_INTR_FILL_DONE_BIT_SHIFT          0x00UL
#define DBH_TRNG_POOL_INTR_FILL_DONE_BIT_SIZE           0x01UL

