Samsung/TizenRT/os/board/bk7239n/src/components/tfm/tfm/platform/ext/target/beken/common/hal/accelerator/dubhe_driver/inc/crypto/dubhe_regs.h
/* TRNG Pool: rn_pool_intr_mask register */
#define DBH_TRNG_POOL_INTR_MASK_REG_OFFSET      0x0CUL
#define DBH_TRNG_POOL_INTR_MASK_FILL_DONE_BIT_SHIFT    0x00UL
#define DBH_TRNG_POOL_INTR_MASK_FILL_DONE_BIT_SIZE     0x01UL

/* TRNG Pool: rn_pool_data_wordx register */
#define DBH_TRNG_POOL_DATA_WORD_REG_OFFSET      0x10UL
#define DBH_TRNG_POOL_DATA_WORD_REG_BYTE_SIZE   0x04UL

/* ACA: grx_sram_addr register */
#define DBH_SRAM_MAP0_REG_OFFSET        0x000UL
#define DBH_SRAM_MAP0_VALUE_BIT_SHIFT   0x0UL
#define DBH_SRAM_MAP0_VALUE_BIT_SIZE    0xCUL
#define DBH_SRAM_MAP1_REG_OFFSET        0x004UL
#define DBH_SRAM_MAP1_VALUE_BIT_SHIFT   0x0UL
#define DBH_SRAM_MAP1_VALUE_BIT_SIZE    0xCUL
#define DBH_SRAM_MAP2_REG_OFFSET        0x008UL
#define DBH_SRAM_MAP2_VALUE_BIT_SHIFT   0x0UL
#define DBH_SRAM_MAP2_VALUE_BIT_SIZE    0xCUL
#define DBH_SRAM_MAP3_REG_OFFSET        0x00CUL
#define DBH_SRAM_MAP3_VALUE_BIT_SHIFT   0x0UL
#define DBH_SRAM_MAP3_VALUE_BIT_SIZE    0xCUL
#define DBH_SRAM_MAP4_REG_OFFSET        0x010UL
#define DBH_SRAM_MAP4_VALUE_BIT_SHIFT   0x0UL
#define DBH_SRAM_MAP4_VALUE_BIT_SIZE    0xCUL
#define DBH_SRAM_MAP5_REG_OFFSET        0x014UL
#define DBH_SRAM_MAP5_VALUE_BIT_SHIFT   0x0UL
#define DBH_SRAM_MAP5_VALUE_BIT_SIZE    0xCUL
#define DBH_SRAM_MAP6_REG_OFFSET        0x018UL
#define DBH_SRAM_MAP6_VALUE_BIT_SHIFT   0x0UL
#define DBH_SRAM_MAP6_VALUE_BIT_SIZE    0xCUL
#define DBH_SRAM_MAP7_REG_OFFSET        0x01CUL
#define DBH_SRAM_MAP7_VALUE_BIT_SHIFT   0x0UL
#define DBH_SRAM_MAP7_VALUE_BIT_SIZE    0xCUL
#define DBH_SRAM_MAP8_REG_OFFSET        0x020UL
#define DBH_SRAM_MAP8_VALUE_BIT_SHIFT   0x0UL
#define DBH_SRAM_MAP8_VALUE_BIT_SIZE    0xCUL
#define DBH_SRAM_MAP9_REG_OFFSET        0x024UL
#define DBH_SRAM_MAP9_VALUE_BIT_SHIFT   0x0UL
#define DBH_SRAM_MAP9_VALUE_BIT_SIZE    0xCUL
#define DBH_SRAM_MAP10_REG_OFFSET       0x028UL
#define DBH_SRAM_MAP10_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP10_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP11_REG_OFFSET       0x02CUL
#define DBH_SRAM_MAP11_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP11_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP12_REG_OFFSET       0x030UL
#define DBH_SRAM_MAP12_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP12_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP13_REG_OFFSET       0x034UL
#define DBH_SRAM_MAP13_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP13_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP14_REG_OFFSET       0x038UL
#define DBH_SRAM_MAP14_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP14_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP15_REG_OFFSET       0x03CUL
#define DBH_SRAM_MAP15_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP15_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP16_REG_OFFSET       0x040UL
#define DBH_SRAM_MAP16_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP16_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP17_REG_OFFSET       0x044UL
#define DBH_SRAM_MAP17_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP17_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP18_REG_OFFSET       0x048UL
#define DBH_SRAM_MAP18_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP18_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP19_REG_OFFSET       0x04CUL
#define DBH_SRAM_MAP19_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP19_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP20_REG_OFFSET       0x050UL
#define DBH_SRAM_MAP20_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP20_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP21_REG_OFFSET       0x054UL
#define DBH_SRAM_MAP21_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP21_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP22_REG_OFFSET       0x058UL
#define DBH_SRAM_MAP22_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP22_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP23_REG_OFFSET       0x05CUL
#define DBH_SRAM_MAP23_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP23_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP24_REG_OFFSET       0x060UL
#define DBH_SRAM_MAP24_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP24_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP25_REG_OFFSET       0x064UL
#define DBH_SRAM_MAP25_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP25_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP26_REG_OFFSET       0x068UL
#define DBH_SRAM_MAP26_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP26_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP27_REG_OFFSET       0x06CUL
#define DBH_SRAM_MAP27_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP27_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP28_REG_OFFSET       0x070UL
#define DBH_SRAM_MAP28_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP28_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP29_REG_OFFSET       0x074UL
#define DBH_SRAM_MAP29_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP29_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP30_REG_OFFSET       0x078UL
#define DBH_SRAM_MAP30_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP30_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_MAP31_REG_OFFSET       0x07CUL
#define DBH_SRAM_MAP31_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_MAP31_VALUE_BIT_SIZE   0xCUL

/* ACA: gr_len_typex register */
#define DBH_LEN_TYPE0_REG_OFFSET        0x100UL
#define DBH_LEN_TYPE0_VALUE_BIT_SHIFT   0x0UL
#define DBH_LEN_TYPE0_VALUE_BIT_SIZE    0xDUL
#define DBH_LEN_TYPE1_REG_OFFSET        0x104UL
#define DBH_LEN_TYPE1_VALUE_BIT_SHIFT   0x0UL
#define DBH_LEN_TYPE1_VALUE_BIT_SIZE    0xDUL
#define DBH_LEN_TYPE2_REG_OFFSET        0x108UL
#define DBH_LEN_TYPE2_VALUE_BIT_SHIFT   0x0UL
#define DBH_LEN_TYPE2_VALUE_BIT_SIZE    0xDUL
#define DBH_LEN_TYPE3_REG_OFFSET        0x10CUL
#define DBH_LEN_TYPE3_VALUE_BIT_SHIFT   0x0UL
#define DBH_LEN_TYPE3_VALUE_BIT_SIZE    0xDUL
#define DBH_LEN_TYPE4_REG_OFFSET        0x1100UL
#define DBH_LEN_TYPE4_VALUE_BIT_SHIFT   0x0UL
#define DBH_LEN_TYPE4_VALUE_BIT_SIZE    0xDUL
#define DBH_LEN_TYPE5_REG_OFFSET        0x114UL
#define DBH_LEN_TYPE5_VALUE_BIT_SHIFT   0x0UL
#define DBH_LEN_TYPE5_VALUE_BIT_SIZE    0xDUL
#define DBH_LEN_TYPE6_REG_OFFSET        0x118UL
#define DBH_LEN_TYPE6_VALUE_BIT_SHIFT   0x0UL
#define DBH_LEN_TYPE6_VALUE_BIT_SIZE    0xDUL
#define DBH_LEN_TYPE7_REG_OFFSET        0x11CUL
#define DBH_LEN_TYPE7_VALUE_BIT_SHIFT   0x0UL
#define DBH_LEN_TYPE7_VALUE_BIT_SIZE    0xDUL

/* ACA: n_p_t0_t1_use_grid register */
#define DBH_N_NP_T0_T1_ADDR_REG_OFFSET  0x120UL
#define DBH_N_NP_T0_T1_ADDR_N_VIRTUAL_ADDR_BIT_SHIFT    0x0UL
#define DBH_N_NP_T0_T1_ADDR_N_VIRTUAL_ADDR_BIT_SIZE     0x5UL
#define DBH_N_NP_T0_T1_ADDR_NP_VIRTUAL_ADDR_BIT_SHIFT   0x5UL
#define DBH_N_NP_T0_T1_ADDR_NP_VIRTUAL_ADDR_BIT_SIZE    0x5UL
#define DBH_N_NP_T0_T1_ADDR_T0_VIRTUAL_ADDR_BIT_SHIFT   0xAUL
#define DBH_N_NP_T0_T1_ADDR_T0_VIRTUAL_ADDR_BIT_SIZE    0x5UL
#define DBH_N_NP_T0_T1_ADDR_T1_VIRTUAL_ADDR_BIT_SHIFT   0xFUL
#define DBH_N_NP_T0_T1_ADDR_T1_VIRTUAL_ADDR_BIT_SIZE    0x5UL

/* ACA: op_cfg register */
#define DBH_OP_CFG_REG_OFFSET  0x124UL
#define DBH_OP_CFG_RUN_BIT_SHIFT        0x0UL
#define DBH_OP_CFG_RUN_BIT_SIZE         0x1UL
#define DBH_OP_CFG_RESERVE_BIT_SHIFT    0x1UL
#define DBH_OP_CFG_RESERVE_BIT_SIZE     0x3UL
#define DBH_OP_CFG_FIFO_WM_BIT_SHIFT    0x4UL
#define DBH_OP_CFG_FIFO_WM_BIT_SIZE     0x4UL
#define DBH_OP_CFG_FIFO_RST_BIT_SHIFT   0x8UL
#define DBH_OP_CFG_FIFO_RST_BIT_SIZE    0x1UL

