Samsung/TizenRT/os/board/bk7239n/src/components/tfm/tfm/platform/ext/target/beken/common/hal/accelerator/dubhe_driver/inc/crypto/dubhe_regs.h
/* ACA: entry register */
#define DBH_OPCODE_ENTRY_REG_OFFSET     0x128UL
#define DBH_OPCODE_ENTRY_NEED_INTR_BIT_SHIFT    0x0UL
#define DBH_OPCODE_ENTRY_NEED_INTR_BIT_SIZE     0x1UL
#define DBH_OPCODE_ENTRY_REG_C_BIT_SHIFT        0x1UL
#define DBH_OPCODE_ENTRY_REG_C_BIT_SIZE         0x5UL
#define DBH_OPCODE_ENTRY_R_DISCARD_BIT_SHIFT    0x6UL
#define DBH_OPCODE_ENTRY_R_DISCARD_BIT_SIZE     0x1UL
#define DBH_OPCODE_ENTRY_REG_R_BIT_SHIFT        0x7UL
#define DBH_OPCODE_ENTRY_REG_R_BIT_SIZE         0x5UL
#define DBH_OPCODE_ENTRY_REG_B_BIT_SHIFT        0xCUL
#define DBH_OPCODE_ENTRY_REG_B_BIT_SIZE         0x5UL
#define DBH_OPCODE_ENTRY_REG_B_IM_BIT_SHIFT     0x11UL
#define DBH_OPCODE_ENTRY_REG_B_IM_BIT_SIZE      0x1UL
#define DBH_OPCODE_ENTRY_REG_A_BIT_SHIFT        0x12UL
#define DBH_OPCODE_ENTRY_REG_A_BIT_SIZE         0x5UL
#define DBH_OPCODE_ENTRY_RESERVE_BIT_SHIFT      0x17UL
#define DBH_OPCODE_ENTRY_RESERVE_BIT_SIZE       0x1UL
#define DBH_OPCODE_ENTRY_LEN_BIT_SHIFT          0x18UL
#define DBH_OPCODE_ENTRY_LEN_BIT_SIZE           0x3UL
#define DBH_OPCODE_ENTRY_OPCODE_BIT_SHIFT       0x1BUL
#define DBH_OPCODE_ENTRY_OPCODE_BIT_SIZE        0x5UL

/* ACA: aca_status register */
#define DBH_ACA_STAT_REG_OFFSET         0x12CUL
#define DBH_ACA_STAT_FIFO_FREE_NUM_BIT_SHIFT    0x0UL
#define DBH_ACA_STAT_FIFO_FREE_NUM_BIT_SIZE     0x4UL
#define DBH_ACA_STAT_FIFO_EMPTY_BIT_SHIFT       0x4UL
#define DBH_ACA_STAT_FIFO_EMPTY_BIT_SIZE        0x1UL
#define DBH_ACA_STAT_FIFO_FULL_BIT_SHIFT        0x5UL
#define DBH_ACA_STAT_FIFO_FULL_BIT_SIZE         0x1UL
#define DBH_ACA_STAT_ADD_RESULT_ZERO_BIT_SHIFT  0x6UL
#define DBH_ACA_STAT_ADD_RESULT_ZERO_BIT_SIZE   0x1UL
#define DBH_ACA_STAT_AND_RESULT_ZERO_BIT_SHIFT  0x7UL
#define DBH_ACA_STAT_AND_RESULT_ZERO_BIT_SIZE   0x1UL
#define DBH_ACA_STAT_XOR_RESULT_ZERO_BIT_SHIFT  0x8UL
#define DBH_ACA_STAT_XOR_RESULT_ZERO_BIT_SIZE   0x1UL
#define DBH_ACA_STAT_ALU_CARRY_BIT_SHIFT        0x9UL
#define DBH_ACA_STAT_ALU_CARRY_BIT_SIZE         0x1UL
/*The times of subtraction as do modular reduction.
  As > 32, it will keep as 31. */
#define DBH_ACA_STAT_REDUCTION_TIMES_BIT_SHIFT  0xAUL
#define DBH_ACA_STAT_REDUCTION_TIMES_BIT_SIZE   0x6UL
/*
ACA engine status
0x0->idle
0x1-> busy run op command by other host
0x2-> busy run op command by this host self
0x3-> reserve
*/
#define DBH_ACA_STAT_ENGIN_STAT_BIT_SHIFT       0x10UL
#define DBH_ACA_STAT_ENGIN_STAT_BIT_SIZE        0x2UL
/*
0x0: indicate 4 k bytes SRAM.
0x1: indicate 8 k bytes SRAM.
0x2: indicate 16 k bytes SRAM.
0x3: reserved.
*/
#define DBH_ACA_STAT_SRAM_SIZE_MODE_BIT_SHIFT   0x12UL
#define DBH_ACA_STAT_SRAM_SIZE_MODE_BIT_SIZE    0x2UL




/*currently, Duhbe HW can support max sram size 16KBytes,
 *so 12bits is enough for sram address
*/
/* ACA: sram_xxx register */
#define DBH_SRAM_WADDR_REG_OFFSET       0x130UL
#define DBH_SRAM_WADDR_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_WADDR_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_WDATA_REG_OFFSET       0x134UL
#define DBH_SRAM_WDATA_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_WDATA_VALUE_BIT_SIZE   0x20UL
#define DBH_SRAM_RADDR_REG_OFFSET       0x138UL
#define DBH_SRAM_RADDR_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_RADDR_VALUE_BIT_SIZE   0xCUL
#define DBH_SRAM_RDATA_REG_OFFSET       0x13CUL
#define DBH_SRAM_RDATA_VALUE_BIT_SHIFT  0x0UL
#define DBH_SRAM_RDATA_VALUE_BIT_SIZE   0x20UL

/* ACA: aca_intr_stat register */
#define DBH_ACA_INTR_STAT_REG_OFFSET    0x140UL
#define DBH_ACA_INTR_STAT_CMD_FINISH_BIT_SHIFT      0x0UL
#define DBH_ACA_INTR_STAT_CMD_FINISH_BIT_SIZE       0x1UL
#define DBH_ACA_INTR_STAT_FIFO_UNDER_WM_BIT_SHIFT   0x1UL
#define DBH_ACA_INTR_STAT_FIFO_UNDER_WM_BIT_SIZE    0x1UL
#define DBH_ACA_INTR_STAT_FIFO_OVERFLOW_BIT_SHIFT   0x2UL
#define DBH_ACA_INTR_STAT_FIFO_OVERFLOW_BIT_SIZE    0x1UL
#define DBH_ACA_INTR_STAT_DIV_ZERO_BIT_SHIFT        0x3UL
#define DBH_ACA_INTR_STAT_DIV_ZERO_BIT_SIZE         0x1UL
#define DBH_ACA_INTR_STAT_MODINV_ZERO_BIT_SHIFT     0x4UL
#define DBH_ACA_INTR_STAT_MODINV_ZERO_BIT_SIZE      0x1UL
#define DBH_ACA_INTR_STAT_ACA_DONE_BIT_SHIFT        0x5UL
#define DBH_ACA_INTR_STAT_ACA_DONE_BIT_SIZE         0x1UL
#define DBH_ACA_INTR_STAT_MULT_RED_ERR_BIT_SHIFT    0x6UL
#define DBH_ACA_INTR_STAT_MULT_RED_ERR_BIT_SIZE     0x1UL

/* ACA: aca_intr_mask register */
#define DBH_ACA_INTR_MASK_REG_OFFSET    0x144UL
#define DBH_ACA_INTR_MASK_CMD_FINISH_BIT_SHIFT      0x0UL
#define DBH_ACA_INTR_MASK_CMD_FINISH_BIT_SIZE       0x1UL
#define DBH_ACA_INTR_MASK_FIFO_UNDER_WM_BIT_SHIFT   0x1UL
#define DBH_ACA_INTR_MASK_FIFO_UNDER_WM_BIT_SIZE    0x1UL
#define DBH_ACA_INTR_MASK_FIFO_OVERFLOW_BIT_SHIFT   0x2UL
#define DBH_ACA_INTR_MASK_FIFO_OVERFLOW_BIT_SIZE    0x1UL
#define DBH_ACA_INTR_MASK_DIV_ZERO_BIT_SHIFT        0x3UL
#define DBH_ACA_INTR_MASK_DIV_ZERO_BIT_SIZE         0x1UL
#define DBH_ACA_INTR_MASK_MODINV_ZERO_BIT_SHIFT     0x4UL
#define DBH_ACA_INTR_MASK_MODINV_ZERO_BIT_SIZE      0x1UL
#define DBH_ACA_INTR_MASK_ACA_DONE_BIT_SHIFT        0x5UL
#define DBH_ACA_INTR_MASK_ACA_DONE_BIT_SIZE         0x1UL
#define DBH_ACA_INTR_MASK_MULT_RED_ERR_BIT_SHIFT    0x6UL
#define DBH_ACA_INTR_MASK_MULT_RED_ERR_BIT_SIZE     0x1UL

/* ACA: aca_suspend_mask register */
#define DBH_ACA_SUSPEND_MASK_REG_OFFSET 0x148UL
#define DBH_ACA_SUSPEND_MASK_CMD_FINISH_BIT_SHIFT    0x0UL
#define DBH_ACA_SUSPEND_MASK_CMD_FINISH_BIT_SIZE     0x1UL
#define DBH_ACA_SUSPEND_MASK_RESERVE_BIT_SHIFT       0x1UL
#define DBH_ACA_SUSPEND_MASK_RESERVE_BIT_SIZE        0x1UL
#define DBH_ACA_SUSPEND_MASK_FIFO_OVERFLOW_BIT_SHIFT 0x2UL
#define DBH_ACA_SUSPEND_MASK_FIFO_OVERFLOW_BIT_SIZE  0x1UL
#define DBH_ACA_SUSPEND_MASK_DIV_ZERO_BIT_SHIFT      0x3UL
#define DBH_ACA_SUSPEND_MASK_DIV_ZERO_BIT_SIZE       0x1UL
#define DBH_ACA_SUSPEND_MASK_MODINV_ZERO_BIT_SHIFT   0x4UL
#define DBH_ACA_SUSPEND_MASK_MODINV_ZERO_BIT_SIZE    0x1UL

/*Bit fields operations macros.*/
#define BITMASK(mask_size) (((mask_size) < 32) ?        \
                            ((1UL << (mask_size)) - 1) : 0xFFFFFFFFUL)
#define BITMASK_AT(mask_size, mask_offset) (BITMASK(mask_size) << (mask_offset))

#define BITFIELD_GET(word, bit_offset, bit_size) \
    (((word) >> (bit_offset)) & BITMASK(bit_size))
#define BITFIELD_SET(word, bit_offset, bit_size, new_val)   do {    \
        word = ((word) & ~BITMASK_AT(bit_size, bit_offset)) |       \
               (((new_val) & BITMASK(bit_size)) << (bit_offset));  \
} while (0)

/*! Bit fields get */
#define DBH_REG_FLD_GET(reg_name, fld_name, reg_val)        \
    (DBH_ ## reg_name ## _ ## fld_name ## _BIT_SIZE == 0x20 ?              \
     reg_val /*!< \internal Optimization for 32b fields */ :               \
     BITFIELD_GET(reg_val, DBH_ ## reg_name ## _ ## fld_name ## _BIT_SHIFT, \
                  DBH_ ## reg_name ## _ ## fld_name ## _BIT_SIZE))


