Samsung/TizenRT/os/board/bk7239n/src/components/tfm/tfm/platform/ext/target/beken/common/hal/accelerator/dubhe_driver/inc/crypto/dubhe_regs.h
/*! Bit fields set */
#define DBH_REG_FLD_SET(reg_name, fld_name, reg_shadow_var, new_fld_val)      \
    do {                                                                     \
        if (DBH_ ## reg_name ## _ ## fld_name ## _BIT_SIZE == 0x20) {       \
            reg_shadow_var = new_fld_val;     /*!< \internal Optimization for
                                               * 32b fields */ \
        } \
        else{                                                             \
            BITFIELD_SET(reg_shadow_var,                             \
                         DBH_ ## reg_name ## _ ## fld_name ## _BIT_SHIFT,  \
                         DBH_ ## reg_name ## _ ## fld_name ## _BIT_SIZE,   \
                         new_fld_val);}                                    \
    } while (0)

/* Usage example:
   uint32_t reg_shadow = DBH_READ_REGISTER(DBH_REG_OFFSET(ACA,OP_CFG));
   DBH_REG_FLD_SET(OP_CFG,RUN,reg_shadow, 1);
   DBH_REG_FLD_SET(OP_CFG,FIFO_WM,reg_shadow, 5);
   DBH_WRITE_REGISTER(DBH_REG_OFFSET(ACA,OP_CFG), reg_shadow);
 */



/*the baseaddress will defined in HAL layer*/
extern uint32_t    _g_Dubhe_RegBase;

//#ifdef REG_DEBUG
#if 0
extern const char* reg_array[10][10];
extern const char* aca_other[20];

#define PRINTF_REG_INFO(unit, reg, val) \
    do { \
        uint32_t reg_offset = unit + reg; \
        switch ( unit ) \
        { \
        case DBH_BASE_TOP_CTRL: \
            PAL_LOG_DEBUG("###WR %-30s addr: 0x%08x  val: 0x%08x\n", \
                   reg_array[0][reg / 4], (uint32_t)reg_offset, (uint32_t)val); \
            break; \
        case DBH_BASE_TOP_STAT: \
            PAL_LOG_DEBUG("###WR %-30s addr: 0x%08x  val: 0x%08x\n", \
                   reg_array[1][reg / 4], (uint32_t)reg_offset, (uint32_t)val); \
            break; \
        case DBH_BASE_DBG_CTRL: \
            PAL_LOG_DEBUG("###WR %-30s addr: 0x%08x  val: 0x%08x\n", \
                   reg_array[2][reg / 4], (uint32_t)reg_offset, (uint32_t)val); \
            break; \
        case DBH_BASE_TRNG_CTRL: \
            PAL_LOG_DEBUG("###WR %-30s addr: 0x%08x, val: 0x%08x\n", \
                   reg_array[3][reg / 4], (uint32_t)reg_offset, (uint32_t)val); \
            break; \
        case DBH_BASE_TRNG_POOL: \
            PAL_LOG_DEBUG("###WR %-30s addr: 0x%08x, val: 0x%08x\n", \
                   reg_array[4][reg / 4], (uint32_t)reg_offset, (uint32_t)val); \
            break; \
        case DBH_BASE_OTP_MGR: \
            PAL_LOG_DEBUG("###WR %-30s addr: 0x%08x, val: 0x%08x\n", \
                   reg_array[5][reg / 4], (uint32_t)reg_offset, (uint32_t)val); \
            break; \
        case DBH_BASE_SECURE_HASH: \
            PAL_LOG_DEBUG("###WR %-30s addr: 0x%08x, val: 0x%08x\n", \
                   reg_array[6][reg / 4], (uint32_t)reg_offset, (uint32_t)val); \
            break; \
        case DBH_BASE_SECURE_SCA: \
            PAL_LOG_DEBUG("###WR %-30s addr: 0x%08x, val: 0x%08x\n", \
                   reg_array[7][reg / 4], (uint32_t)reg_offset, (uint32_t)val); \
            break; \
        case DBH_BASE_ACA: \
            PAL_LOG_DEBUG("###WR %-30s addr: 0x%08x, val: 0x%08x\n", \
                   aca_other[(reg - 0x120) / 4], \
                   (uint32_t)reg_offset, \
                   (uint32_t)val); \
            break; \
        default: \
            break; \
        } \
    } while ( 0 )

#if 0

#endif

#define PRINTF_ACA_SRAM_REG(reg_offset, val) \
    do { \
        uint32_t reg_val = ((reg_offset) - DBH_BASE_ACA); \
        if (reg_val < 0x100) { \
            PAL_LOG_DEBUG("###WR (DBH_SRAM_MAP%u_REG) addr: 0x%08x, val: 0x%08x\n", \
                   (unsigned int)reg_val / 4, \
                   (unsigned int)reg_offset, \
                   (unsigned int)val);} \
        else{ \
            PAL_LOG_DEBUG("###WR (DBH_LEN_TYPE%u_REG) addr: 0x%08x, val: 0x%08x\n", \
                   (unsigned int)(reg_val - 0x100) / 4, \
                   (unsigned int)reg_offset, \
                   (unsigned int)val);} \
    } while (0)
#else
#define PRINTF_ACA_SRAM_REG(reg_offset, val) do {} while (0)
#define PRINTF_REG_INFO(unit, reg, val) do {} while (0)
#endif

/* Register Offset macro */
#define DBH_REG_OFFSET(unit_name, reg_name)               \
    (DBH_BASE_ ## unit_name + DBH_ ## reg_name ## _REG_OFFSET)

#define DBH_READ_REGISTER2(regOffset) \
    (*((volatile uint32_t*)(_g_Dubhe_RegBase + (regOffset))))

#define DBH_WRITE_REGISTER2(regOffset, val) \
    do { \
        PRINTF_ACA_SRAM_REG(regOffset, val); \
        (*((volatile uint32_t*)(_g_Dubhe_RegBase + (regOffset))) = (val)); \
    } while (0)


#define DBH_READ_REGISTER(unit_name, reg_name) \
    (*((volatile uint32_t*)(_g_Dubhe_RegBase + \
                            (DBH_REG_OFFSET(unit_name, reg_name)))))

#define DBH_WRITE_REGISTER(unit_name, reg_name, val) \
    do { \
        uint32_t unit = DBH_BASE_ ## unit_name;  \
        uint32_t reg  = DBH_ ## reg_name ## _REG_OFFSET; \
        PRINTF_REG_INFO(unit, reg, val); \
        (*((volatile uint32_t*)(_g_Dubhe_RegBase + (reg + unit))) = (val)); \
    } while (0)

#endif

/*************************** The End Of File*****************************/
